<script setup lang="ts">

let stepperItems = ref(['Универсальность', 'Уход', 'Периодичность коррекции', 'Формальность', 'Тип волос', 'Форма лица'])
let selectVariants = ref({
  universal: [
    "🧒 До 18 лет — подросткам",
    "🧑 18–35 лет — для молодёжи",
    "🧔‍♂️ 35+ лет — для зрелого возраста",
    "👥 Все возрасты",
  ]
})

let promptForm = ref({
  universal: "",
  hairStyling: "",
  haircutFrequency: "",
  formalStyle: "",
  hairType: "",
  faceShape: "",
})

let universal = ref<number[]>([])
watch(universal, (newValue) => {
  if (newValue.includes(3) && newValue.length > 1) {
    universal.value = [3]
    return;
  }
  let res = "";
  for (let idx of universal.value) {
    res += selectVariants.value.universal[idx] + " ";
  }
  promptForm.value.universal = res;
})

/*
  1. Универсальность (насколько подходит разным типам внешности и возрастам)
  🧒 До 18 лет — подходит подросткам
  🧑 18–35 лет — лучший выбор для молодёжи
  🧔‍♂️ 35+ лет — для зрелого возраста
  👥 Все возрасты — универсальный вариант
  2. Уход (сложность ежедневной укладки)
  💨 — не требует укладки
  🪮 — лёгкая укладка
  🧴 — нужна стайлинг-продукция
  3. Периодичность коррекции (как часто нужно обновлять)
  🗓️ — раз в месяц
  ⏳ — держит форму долго
  🔁 — требует частого обновления
  4. Формальность (насколько уместна в деловой обстановке)
  💼 — деловой стиль
  👔 — универсально
  🧢 — повседневно
  5. Тип волос (для какой структуры волос идеальна)
  ➿ — вьющиеся
  〰️ — прямые
  🔁 — любые
  6. Форма лица (каким формам лица наиболее подходит)
  🔵 — круглое
  ⬛ — квадратное
  🔷 — ромбовидное
  ⭕ — универсально
*/
watch(promptForm, (newValue) => {
  console.log(newValue);

}, { deep: true })
</script>
<template>
  <v-stepper :items="stepperItems">
    <template v-slot:item.1>
      <v-sheet>
        <v-responsive class="overflow-y-auto">
          <v-chip-group v-model="universal" selected-class="text-primary" multiple column>
            <v-chip v-for="tag in selectVariants.universal" :key="tag" :text="tag" density="default"></v-chip>
          </v-chip-group>
        </v-responsive>
      </v-sheet>
    </template>

    <template v-slot:item.2>
      <v-card flat>...</v-card>
    </template>

    <template v-slot:item.3>
      <v-card flat>...</v-card>
    </template>
  </v-stepper>
</template>